stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_bus.h
/**
  * @brief  Release APB0 peripherals reset.
  * @rmtoll APB0RSTR    TIM2RST      LL_APB0_GRP1_ForceReset
  *         APB0RSTR    TIM16RST     LL_APB0_GRP1_ForceReset
  *         APB0RSTR    SYSCFGRST    LL_APB0_GRP1_ForceReset
  *         APB0RSTR    LCDRST      LL_APB0_GRP1_ForceReset
  *         APB0RSTR    COMPRST      LL_APB0_GRP1_ForceReset
  *         APB0RSTR    DACRST       LL_APB0_GRP1_ForceReset
  *         APB0RSTR    RTCRST       LL_APB0_GRP1_ForceReset
  *         APB0RSTR    LCSCRST       LL_APB0_GRP1_ForceReset
  *         APB0RSTR    WDGRST       LL_APB0_GRP1_ForceReset
  *         APB0RSTR    DBGMCURST    LL_APB0_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  * @arg LL_APB0_GRP1_PERIPH_TIM2
  * @arg LL_APB0_GRP1_PERIPH_TIM16
  * @arg LL_APB0_GRP1_PERIPH_SYSCFG
  * @arg LL_APB0_GRP1_PERIPH_LCDC
  * @arg LL_APB0_GRP1_PERIPH_COMP
  * @arg LL_APB0_GRP1_PERIPH_DAC
  * @arg LL_APB0_GRP1_PERIPH_RTC
  * @arg LL_APB0_GRP1_PERIPH_LCSC
  * @arg LL_APB0_GRP1_PERIPH_WDG
  * @arg LL_APB0_GRP1_PERIPH_DBGMCU
  * @retval None
  */
__STATIC_INLINE void LL_APB0_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB0RSTR, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB1 APB1
  * @{
  */

/**
  * @brief  Enable APB1 peripherals clock.
  * @rmtoll APB1ENR      SPI1EN        LL_APB1_GRP1_EnableClock
  *         APB1ENR      ADCDIGEN      LL_APB1_GRP1_EnableClock
  *         APB1ENR      ADCANAEN      LL_APB1_GRP1_EnableClock
  *         APB1ENR      LPUARTEN      LL_APB1_GRP1_EnableClock
  *         APB1ENR      USARTEN       LL_APB1_GRP1_EnableClock
  *         APB1ENR      SPI3EN        LL_APB1_GRP1_EnableClock
  *         APB1ENR      I2C1EN        LL_APB1_GRP1_EnableClock
  *         APB1ENR      I2C2EN        LL_APB1_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  * @arg LL_APB1_GRP1_PERIPH_SPI1
  * @arg LL_APB1_GRP1_PERIPH_ADCDIG
  * @arg LL_APB1_GRP1_PERIPH_ADCANA
  * @arg LL_APB1_GRP1_PERIPH_LPUART1
  * @arg LL_APB1_GRP1_PERIPH_USART1
  * @arg LL_APB1_GRP1_PERIPH_SPI3
  * @arg LL_APB1_GRP1_PERIPH_I2C1
  * @arg LL_APB1_GRP1_PERIPH_I2C2
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB1ENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB1ENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 peripheral clock is enabled or not
  * @rmtoll APB1ENR      SPI1EN        LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      ADCDIGEN      LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      ADCANAEN      LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      LPUARTEN      LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      USARTEN       LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      SPI3EN        LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      I2C1EN        LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      I2C2EN        LL_APB1_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  * @arg LL_APB1_GRP1_PERIPH_SPI1
  * @arg LL_APB1_GRP1_PERIPH_ADCDIG
  * @arg LL_APB1_GRP1_PERIPH_ADCANA
  * @arg LL_APB1_GRP1_PERIPH_LPUART1
  * @arg LL_APB1_GRP1_PERIPH_USART1
  * @arg LL_APB1_GRP1_PERIPH_SPI3
  * @arg LL_APB1_GRP1_PERIPH_I2C1
  * @arg LL_APB1_GRP1_PERIPH_I2C2
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_APB1_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB1ENR, Periphs) == (Periphs)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB1 peripherals clock.
  * @rmtoll APB1ENR      SPI1EN        LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      ADCDIGEN      LL_APB1_GRP1_DisableClock
  *         APB1ENR      ADCANAEN      LL_APB1_GRP1_DisableClock
  *         APB1ENR      LPUARTEN      LL_APB1_GRP1_DisableClock
  *         APB1ENR      USARTEN       LL_APB1_GRP1_DisableClock
  *         APB1ENR      SPI3EN        LL_APB1_GRP1_DisableClock
  *         APB1ENR      I2C1EN        LL_APB1_GRP1_DisableClock
  *         APB1ENR      I2C2EN        LL_APB1_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  * @arg LL_APB1_GRP1_PERIPH_SPI1
  * @arg LL_APB1_GRP1_PERIPH_ADCDIG
  * @arg LL_APB1_GRP1_PERIPH_ADCANA
  * @arg LL_APB1_GRP1_PERIPH_LPUART1
  * @arg LL_APB1_GRP1_PERIPH_USART1
  * @arg LL_APB1_GRP1_PERIPH_SPI3
  * @arg LL_APB1_GRP1_PERIPH_I2C1
  * @arg LL_APB1_GRP1_PERIPH_I2C2
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB1ENR, Periphs);
}

/**
  * @brief  Enable APB1 peripherals clock in sleep mode.
  * @rmtoll APB1ENR      SPI1EN        LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      ADCDIGEN      LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      LPUARTEN      LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      USARTEN       LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      SPI3EN        LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      I2C1EN        LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      I2C2EN        LL_APB1_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  * @arg LL_APB1_GRP1_PERIPH_SPI1
  * @arg LL_APB1_GRP1_PERIPH_ADCDIG
  * @arg LL_APB1_GRP1_PERIPH_LPUART1
  * @arg LL_APB1_GRP1_PERIPH_USART1
  * @arg LL_APB1_GRP1_PERIPH_SPI3
  * @arg LL_APB1_GRP1_PERIPH_I2C1
  * @arg LL_APB1_GRP1_PERIPH_I2C2
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_EnableClockSleepMode(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB1SMENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB1SMENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 peripheral clock is enabled or not in sleep mode.
  * @rmtoll APB1ENR      SPI1EN        LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      ADCDIGEN      LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      LPUARTEN      LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      USARTEN       LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      SPI3EN        LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      I2C1EN        LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      I2C2EN        LL_APB1_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  * @arg LL_APB1_GRP1_PERIPH_SPI1
  * @arg LL_APB1_GRP1_PERIPH_ADCDIG
  * @arg LL_APB1_GRP1_PERIPH_LPUART1
  * @arg LL_APB1_GRP1_PERIPH_USART1
  * @arg LL_APB1_GRP1_PERIPH_SPI3
  * @arg LL_APB1_GRP1_PERIPH_I2C1
  * @arg LL_APB1_GRP1_PERIPH_I2C2
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_APB1_GRP1_IsEnabledClockSleepMode(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB1SMENR, Periphs) == (Periphs)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB1 peripherals clock in sleep mode.
  * @rmtoll APB1ENR      SPI1EN        LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      ADCDIGEN      LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      LPUARTEN      LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      USARTEN       LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      SPI3EN        LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      I2C1EN        LL_APB1_GRP1_IsEnabledClock
  *         APB1ENR      I2C2EN        LL_APB1_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  * @arg LL_APB1_GRP1_PERIPH_SPI1
  * @arg LL_APB1_GRP1_PERIPH_ADCDIG
  * @arg LL_APB1_GRP1_PERIPH_LPUART1
  * @arg LL_APB1_GRP1_PERIPH_USART1
  * @arg LL_APB1_GRP1_PERIPH_SPI3
  * @arg LL_APB1_GRP1_PERIPH_I2C1
  * @arg LL_APB1_GRP1_PERIPH_I2C2
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClockSleepMode(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB1SMENR, Periphs);
}

/**
  * @brief  Force APB1 peripherals reset.
  * @rmtoll APB1RSTR     SPI1RST       LL_APB1_GRP1_ForceReset
  *         APB1RSTR     ADCRST        LL_APB1_GRP1_ForceReset
  *         APB1RSTR     LPUARTRST     LL_APB1_GRP1_ForceReset
  *         APB1RSTR     USARTRST      LL_APB1_GRP1_ForceReset
  *         APB1RSTR     SPI3RST       LL_APB1_GRP1_ForceReset
  *         APB1RSTR     I2C1RST       LL_APB1_GRP1_ForceReset
  *         APB1RSTR     I2C2RST       LL_APB1_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  * @arg LL_APB1_GRP1_PERIPH_ALL
  * @arg LL_APB1_GRP1_PERIPH_SPI1
  * @arg LL_APB1_GRP1_PERIPH_ADCDIG
  * @arg LL_APB1_GRP1_PERIPH_LPUART1
  * @arg LL_APB1_GRP1_PERIPH_USART1
  * @arg LL_APB1_GRP1_PERIPH_SPI3
  * @arg LL_APB1_GRP1_PERIPH_I2C1
  * @arg LL_APB1_GRP1_PERIPH_I2C2
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->APB1RSTR, Periphs);
}

/**
  * @brief  Release APB1 peripherals reset.
  * @rmtoll APB1RSTR     SPI1RST       LL_APB1_GRP1_ReleaseReset
  *         APB1RSTR     ADCRST        LL_APB1_GRP1_ReleaseReset
  *         APB1RSTR     LPUARTRST     LL_APB1_GRP1_ReleaseReset
  *         APB1RSTR     USARTRST      LL_APB1_GRP1_ReleaseReset
  *         APB1RSTR     SPI3RST       LL_APB1_GRP1_ReleaseReset
  *         APB1RSTR     I2C1RST       LL_APB1_GRP1_ReleaseReset
  *         APB1RSTR     I2C2RST       LL_APB1_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  * @arg LL_APB1_GRP1_PERIPH_ALL
  * @arg LL_APB1_GRP1_PERIPH_SPI1
  * @arg LL_APB1_GRP1_PERIPH_ADCDIG
  * @arg LL_APB1_GRP1_PERIPH_LPUART1
  * @arg LL_APB1_GRP1_PERIPH_USART1
  * @arg LL_APB1_GRP1_PERIPH_SPI3
  * @arg LL_APB1_GRP1_PERIPH_I2C1
  * @arg LL_APB1_GRP1_PERIPH_I2C2
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB1RSTR, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB2 APB2
  * @{
  */
/**
  * @brief  Enable APB2 peripherals clock.
  * @rmtoll APB2ENR      MRSUBGEN       LL_APB2_GRP1_EnableClock
  * @rmtoll APB2ENR      LPAWUREN       LL_APB2_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  * @arg LL_APB2_GRP1_PERIPH_MRSUBG
  * @arg LL_APB2_GRP1_PERIPH_LPAWUR
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB2ENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB2ENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB2 peripheral clock is enabled or not
  * @rmtoll APB2ENR      MRSUBGEN       LL_APB2_GRP1_IsEnabledClock
  * @rmtoll APB2ENR      LPAWUREN       LL_APB2_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  * @arg LL_APB2_GRP1_PERIPH_MRSUBG
  * @arg LL_APB2_GRP1_PERIPH_LPAWUR
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_APB2_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB2ENR, Periphs) == (Periphs)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB2 peripherals clock.
  * @rmtoll APB2ENR      MRSUBGEN       LL_APB2_GRP1_DisableClock
  * @rmtoll APB2ENR      LPAWUREN        LL_APB2_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  * @arg LL_APB2_GRP1_PERIPH_MRSUBG
  * @arg LL_APB2_GRP1_PERIPH_LPAWUR
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB2ENR, Periphs);
}

/**
  * @brief  Force APB2 peripherals reset.
  * @rmtoll APB2RSTR     MRSUBGRST       LL_APB2_GRP1_ForceReset
  * @rmtoll APB2RSTR     LPAWURRST        LL_APB2_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  * @arg LL_APB2_GRP1_PERIPH_MRSUBG
  * @arg LL_APB2_GRP1_PERIPH_LPAWUR
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->APB2RSTR, Periphs);
}

/**
  * @brief  Release APB2 peripherals reset.
  * @rmtoll APB2RSTR     MRSUBGRST       LL_APB2_GRP1_ReleaseReset
  * @rmtoll APB2RSTR     LPAWURRST        LL_APB2_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  * @arg LL_APB2_GRP1_PERIPH_MRSUBG
  * @arg LL_APB2_GRP1_PERIPH_LPAWUR
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB2RSTR, Periphs);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RCC) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32WL3x_LL_BUS_H */
